In [56]:
"""1. Zaimportuj moduł pandas i numpy nadaj im standardowe aliasy"""

import pandas as pd
import numpy as np

In [57]:
"""2. Do zmiennej customer_names zaimportuj z pliku customers.csv kolumny: CustomerID i CompanyName"""

customer_names = pd.read_csv("/Users/kamilw/Desktop/Moje/PythonLearing/Pandas_Udemy/course-files/northwind-mongo-master/customers.csv",
                            usecols=['CustomerID','City'])

In [58]:
"""3. Do zmiennej customer_cities zaimportuj z pliku customers.csv kolumny: CustomerID, City i Country"""

customer_cities = pd.read_csv("/Users/kamilw/Desktop/Moje/PythonLearing/Pandas_Udemy/course-files/northwind-mongo-master/customers.csv",
                             usecols=['CustomerID','Country'])

In [59]:
"""4. Wyświetl ilość elementów w obu tych zmiennych"""

print(len(customer_names))
print(len(customer_cities))

91
91

In [60]:
"""5. Dodaj do obu zmiennych indeks na kolumnie CustomerID"""

customer_names.set_index('CustomerID',inplace=True)
customer_cities.set_index('CustomerID',inplace=True)

In [61]:
"""6. Korzystając z polecenia join połącz dane z obu data frame. Dane mają być połączone 'po indeksie'"""

customer_names.join(customer_cities).head()

                    City  Country
CustomerID
ALFKI             Berlin  Germany
ANATR       M?©xico D.F.   Mexico
ANTON       M?©xico D.F.   Mexico
AROUT             London       UK
BERGS             Lule??   Sweden

In [62]:
"""7. Ile wierszy jest w wyniku złączenia?"""

len(customer_names.join(customer_cities))

91

In [63]:
"""8. Aby przećwiczyć inny rodzaj złączenia danych zresetuj indeks w customer_names"""

customer_names.reset_index()

   CustomerID          City
0       ALFKI        Berlin
1       ANATR  M?©xico D.F.
2       ANTON  M?©xico D.F.
3       AROUT        London
4       BERGS        Lule??
..        ...           ...
86      WARTH          Oulu
87      WELLI       Resende
88      WHITC       Seattle
89      WILMK      Helsinki
90      WOLZA      Warszawa

[91 rows x 2 columns]

In [64]:
"""9. Korzystając z polecenia join połącz dane z obu data frame, ale tym razem wskaż jawnie, że do połaczenia ma
być wykorzystywana kolumna CustomerID z data frame customer_names"""

customer_names.join(customer_cities,on='CustomerID')

                    City  Country
CustomerID
ALFKI             Berlin  Germany
ANATR       M?©xico D.F.   Mexico
ANTON       M?©xico D.F.   Mexico
AROUT             London       UK
BERGS             Lule??   Sweden
...                  ...      ...
WARTH               Oulu  Finland
WELLI            Resende   Brazil
WHITC            Seattle      USA
WILMK           Helsinki  Finland
WOLZA           Warszawa   Poland

[91 rows x 2 columns]

In [65]:
"""10. Ile jest wierszy w wyniku połączenia?"""

len(customer_names.join(customer_cities, on='CustomerID'))

91